{"data": [
    {
        "id": 29,
        "type": "V",
        "is_hidden": false,
        "position": 1,
        "level": 1,
        "components": [27],
        "characters": "三",
        "radical_picture": null,
        "meaning_mnemonic" : "When a vocab is a single kanji and alone like this, it usually steals its meaning from the parent kanji. That goes for this word too, making the meaning of this word three.",
        "meanings": [
            {
                "text": "Three",
                "is_primary": true
            }
        ],
        "reading_mnemonic": "When a vocab is alone like this with no okurigana (hiragana attached to the kanji) it usually uses its kunyomi reading. Numbers are an exception, though, and use the onyomi reading. You learned the onyomi reading when you learned this kanji, so you already know that the reading for this vocab is さん.",
        "readings": [
            {
                "kana":"さん",
                "is_primary": true,
                "is_accepted": null,
                "is_on": null,
                "is_kun": null
            }
        ],
        "sentences": [
            {
                "text":"このもんだいようしは、ぜんぶで三ページあります。",
                "translation": "There are three pages of these questions total."
            },
            {
                "text":"わたしは三十二さいです。",
                "translation": "I’m 32 years old."
            },
            {
                "text":"三かいまわってワンとほえろ。",
                "translation": "Turn around three times and bark!"
            }
        ],
        "extra_data": "Part Of Speech: Numeral",
        "url_handle": "v/三"
    },
    {
        "id": 30,
        "type": "V",
        "is_hidden": false,
        "position": 2,
        "level": 1,
        "components": [27],
        "characters": "三つ",
        "radical_picture": null,
        "meaning_mnemonic" : "This word follows the \"number of things\" pattern where there's a kanji for a number plus つ on the end. Whenever you see this, you know the word means \"____ things.\" Knowing that, as long as you know the kanji (which you do) you can figure out what number of things it is. For this one, it's the kanji for three plus つ. So, this one is three things.",
        "meanings": [
            {
                "text": "Three Things",
                "is_primary": true
            }
        ],
        "reading_mnemonic": "Since all of the \"number of things\" words all follow the same pattern (number plus つ), you really just have to remember the part before the つ (and then remember that the つ is in all of these). All of the readings are the kunyomi reading, which means we'll have to use a mnemonic to remember them (you know the onyomi reading of the kanji portion). What thing do you have three of? The three things that you have are actually three versions of yourself. \"Who is the real one?\" you ask yourself. \"It's me!\" \"Wait, no, it's me!\" Just remember that there are three of you, and they're all saying \"me me me me me\" to try and prove that they're the real you.",
        "readings": [
            {
                "kana":"みっつ",
                "is_primary": true,
                "is_accepted": null,
                "is_on": null,
                "is_kun": null
            }
        ],
        "sentences": [
            {
                "text":"三つのせんたくしがおんせいできこえます。",
                "translation": "You will hear three choices."
            },
            {
                "text":"ここにボールを三つ入れてください。",
                "translation": "Please put three balls in here."
            },
            {
                "text":"三つもかにかまれた。",
                "translation": "I got three mosquito bites."
            }
        ],
        "extra_data": "Part Of Speech: Numeral",
        "url_handle": "v/三つ"
    },
    {
        "id": 31,
        "type": "V",
        "is_hidden": false,
        "position": 3,
        "level": 1,
        "components": [28],
        "characters": "人",
        "radical_picture": null,
        "meaning_mnemonic" : "When a vocab is a single kanji all alone, it usually has the same meaning as its kanji parent. That goes for this vocab word as well. Person is person.",
        "meanings": [
            {
                "text": "Person",
                "is_primary": true
            }
        ],
        "reading_mnemonic": "When a vocab is a single kanji with no okurigana (hiragana attached to the kanji), it usually uses the kunyomi reading. Since you don't know the kunyomi reading for this kanji yet, let's use a mnemonic to learn it. What does a person hate more than anything? They hate extreme heat (ひと). You can always put on more clothes to stay warm, but when the heat gets too high, you can only take off so much.",
        "readings": [
            {
                "kana":"ひと",
                "is_primary": true,
                "is_accepted": null,
                "is_on": null,
                "is_kun": null
            }
        ],
        "sentences": [
            {
                "text":"やじるしの人はなんといいますか。",
                "translation": "What will the person the arrow is pointing at say?"
            },
            {
                "text":"あの人は何人ですか？",
                "translation": "What is that person's nationality?"
            },
            {
                "text":"人びとは、かれをばかな人だという。",
                "translation": "People say he's a stupid person."
            }
        ],
        "extra_data": "Part Of Speech: Noun",
        "url_handle": "v/人"
    },
    {
        "id": 32,
        "type": "V",
        "is_hidden": false,
        "position": 4,
        "level": 1,
        "components": [27, 28],
        "characters": "三人",
        "radical_picture": null,
        "meaning_mnemonic" : "You have the kanji for three and person. Common sense will tell you what this word is. It's three people.",
        "meanings": [
            {
                "text": "Three People",
                "is_primary": true
            },
            {
                "text": "Three Persons",
                "is_primary": false
            }
        ],
        "reading_mnemonic": "This jukugo (combo kanji) word uses the onyomi readings that you learned when you learned the kanji. That means you should know the reading as long as you know the kanji.",
        "readings": [
            {
                "kana":"さんにん",
                "is_primary": true,
                "is_accepted": null,
                "is_on": null,
                "is_kun": null
            }
        ],
        "sentences": [
            {
                "text":"わたしには、きょうだいが三人います。",
                "translation": "I have three siblings."
            },
            {
                "text":"その川には二、三人しかいませんでした。",
                "translation": "There were only two or three people in the river."
            },
            {
                "text":"三人のうちで、だれがいちばんタイプ？",
                "translation": "Out of those three people, which one is your type?"
            }
        ],
        "extra_data": "Part Of Speech: Noun",
        "url_handle": "v/三人"
    }
]}