/* This is lyrics to the first 16 lines of song ウミユリ海底譚
* I transformed it into three versions:
* 1) hiragana - just a kana representation that will be used as reference
* 2) cyrillic.sloppy - an inconsistent and borderline incorrect(but still parsable) cyrillic version
* 3) cyrillic.strictPolivanov - cyrillic version that was obtained using Polivanov System
* both cyrillic versions are expected to match the reference after transcription */

export default {
    "hiragana": [
        "まってわかって",
        "なんでもないからぼくのうたをわらわないで",
        "くうちゅうさんぽのSOS",
        "ぼくはぼくはぼくは",
        "いまはいにまみれてく",
        "うみのそこいきをのみほすゆめをみた",
        "ただゆらぎのなかそらをながめる",
        "ぼくのてをさえぎった",
        "ゆめのあとがきみのおえつが",
        "はきだせないうたかたのにわのすみを",
        "ひかりのおよぐんそらにさざめく",
        "もじのおくなみのはざまで",
        "きみがとおのいただけ",
        "なんて",
        "もっとすがってよしってしまうから",
        "ぼくのうたをわらわないで",
    ],
    "cyrillic": {
        "sloppy": [
            "маттевакаттэ",
            "нандемонайкарабокуноутаовараванаиде",
            "куучуусанпоноSOS",
            "бокухабокухабокуха",
            "имахайнимамиретеку",
            "уминосокоикиономихосуюмеомита",
            "тадаюрагинонакасораонагамеру",
            "бокунотэосаегитта",
            "юмэноатогакиминооетсуга",
            "хакидасенайутакатанониваносумио",
            "хикариноойогусоранисазамеку",
            "можиноокунаминохазамаде",
            "кимигатооноитадаке",
            "нанте",
            "моттосугаттэёшиттесимаукара",
            "бокуноутаовараванайдэ",            
        ],
        "strictPolivanov": [
            "маттэвакаттэ",
            "нандэмонаикарабокунотаовараванаидэ",
            "кутюсампоноSOS",
            "бокухабокухабокуха",
            "имахаинимамирэтэку",
            "уминосокоикиономихосуюмэомита",
            "тадаюрагинонакасораонагамэру",
            "бокунотэосаэгитта",
            "юмэноатогакиминооэцуга",
            "хакидасэнаиутакатанониваносумио",
            "хикаринооёгунсоранисадзамэку",
            "модзиноокунаминохадзамадэ",
            "кимигатооноитадакэ",
            "нантэ",
            "моттосугаттэёситтэсимаукара",
            "бокунотаовараванаидэ",
        ]
    }
}