/* This is lyrics to the first 16 lines of song ウミユリ海底譚
* I transformed it into three versions:
* 1) hiragana - just a kana representation that will be used as reference
* 2) cyrillic.sloppy - an inconsistent and borderline incorrect(but still parsable) cyrillic version
* 3) cyrillic.strictPolivanov - cyrillic version that was obtained using Polivanov System
* both cyrillic versions are expected to match the reference after transcription */

export default {
    "hiragana": [
        "まってわかって",
        "なんでもないからぼくのうたをわらわないで",
        "くうちゅうさんぽのsos",
        "ぼくはぼくはぼくは",
        "いまはいにまみれてく",
        "うみのそこいきをのみほすゆめをみた",
        "ただゆらぎのなかそらをながめる",
        "ぼくのてをさえぎった",
        "ゆめのあとがきみのおえつが",
        "はきだせないうたかたのにわのすみを",
        "ひかりのおよぐそらにさざめく",
        "もじのおくなみのはざまで",
        "きみがとおのいただけ",
        "なんて",
        "もっとすがってよしってしまうから",
        "ぼくのうたをわらわないで",
    ],
    "cyrillic": {
        "sloppy": [
            "маттевакаттэ",
            "нандемонайкарабокуноутавовараванаиде",
            "куучуусанпоноsos",
            "бокухабокухабокуха",
            "имахайнимамиретеку",
            "уминосокоикивономихосуюмевомита",
            "тадаюрагинонакасоравонагамеру",
            "бокунотэвосаегитта",
            "юмэноатогакиминооетсуга",
            "хакидасенаййутакатанониваносумиво",
            "хикариноойогусоранисазамеку",
            "можиноокунаминохазамаде",
            "кимигатооноитадаке",
            "нанте",
            "моттосугаттэёшиттесимаукара",
            "бокуноутавовараванайдэ",            
        ],
        "strictPolivanov": [
            "маттэвакаттэ",
            "нандэмонаикарабокуноутавовараванаидэ",
            "куутюусанпоноsos",
            "бокухабокухабокуха",
            "имахаинимамирэтэку",
            "уминосокоикивономихосуюмэвомита",
            "тадаюрагинонакасоравонагамэру",
            "бокунотэвосаэгитта",
            "юмэноатогакиминооэцуга",
            "хакидасэнаиутакатанониваносумиво",
            "хикаринооёгусоранисадзамэку",
            "модзиноокунаминохадзамадэ",
            "кимигатооноитадакэ",
            "нантэ",
            "моттосугаттэёситтэсимаукара",
            "бокуноутавовараванаидэ",
        ]
    }
}